content = r'''下图是ERP系统的流图，根据系统需求和流程图，归纳出比较清晰的主、备选流关系表，并基于主、备选流设计场景和相应的测试用例。
'''

basic_list = r'''
| 路 径   | 触发条件                                                     |
| ------- | ------------------------------------------------------------ |
| 基本流  | ①库存可用产品数量不满足销售需求    ②库存可用零部件数量不能满足生产需求    ③所采购的部件入库质检全部合格    ④所生产的部件及产品全部合格 |
| 备选流1 | 库存可用产品数量满足销售需求                                 |
| 备选流2 | ①库存可用产品数量不满足销售需求    ②库存可用零部件数量能满足生产需求 |
| 备选流3 | ①库存可用产品数量不满足销售需求    ②库存可用零部件数量不能满足生产需求    ③所采购的部件入库质检部分不合格 |
| 备选流4 | ①库存可用产品数量不满足销售需求    ②所生产的部件及产品需返工 |
| 备选流5 | ①库存可用产品数量不满足销售需求    ②所生产的部件及产品有废品 |



'''

scene_list = r'''
|            分类            |        |           说明            |
| :------------------------: | :----: | :-----------------------: |
|  场景一——销售合同顺利完成  | 基本流 |                           |
| 场景二——库存不满足销售需求 | 基本流 |          备选流1          |
|    场景三——没有可用库存    | 基本流 |          备选流2          |
| 场景四——库存不满足生产需求 | 基本流 |          备选流3          |
|   场景五——采购质检不合格   | 基本流 |          备选流4          |
|   场景六——生产质检不合格   | 基本流 |          备选流5          |
|        场景七——返工        | 基本流 |          备选流6          |
|        场景八——废品        | 基本流 |          备选流7          |
|     场景九——发货未完成     | 基本流 |          备选流8          |
|           场景十           | 基本流 | 备选流1，备选流2，备选流x |
|          场景十一          | 基本流 | 备选流1，备选流2，备选流7 |


'''

logic_usecase = r'''
| 测试用例编号 | 场景   | 销售合同 | 库存满足销售需求 | 有无库存 | 库存满足生产需求 | 采购质检 | 生产质检 | 返工 | 废品 | 发货未完成 | 合同结案 | 预期结果           |
| ------------ | ------ | -------- | ---------------- | -------- | ---------------- | -------- | -------- | ---- | ---- | ---------- | -------- | ------------------ |
| 1            | 场景1  | V        | V                | V        | V                | N/A      | V        | N/A  | N/A  | N/A        | V        | 合同结案           |
| 2            | 场景2  | V        | I                | V        | V                | N/A      | V        | N/A  | N/A  | N/A        | V        | 库存不满足销售需求 |
| 3            | 场景3  | V        | I                | I        | V                | N/A      | V        | N/A  | N/A  | N/A        | V        | 没有可用库存       |
| 4            | 场景4  | V        | I                | I        | I                | V        | V        | N/A  | N/A  | N/A        | V        | 库存不满足生产需求 |
| 5            | 场景5  | V        | I                | I        | I                | I        | N/A      | N/A  | N/A  | V          | I        | 采购质检不合格     |
| 6            | 场景6  | V        | I                | I        | I                | I        | I        | N/A  | N/A  | V          | I        | 生产质检不合格     |
| 7            | 场景7  | V        | I                | I        | I                | I        | N/A      | V    | N/A  | V          | I        | 返工               |
| 8            | 场景8  | V        | I                | I        | I                | I        | I        | N/A  | V    | V          | I        | 废品               |
| 9            | 场景9  | V        | I                | I        | I                | I        | I        | N/A  | N/A  | V          | I        | 发货未完成         |
| 10           | 场景10 | V        | I                | V        | V                | N/A      | V        | N/A  | N/A  | N/A        | V        | 合同结案           |
| 11           | 场景11 | V        | I                | I        | V                | V        | V        | N/A  | N/A  | N/A        | V        | 合同结案           |


'''